[
  {
    "title": "Case Study: Comparing Liquid Staking Tokens, Native Token vs Fiat as Collateral Alternatives when Selling Call Options",
    "link": "https://blog.lido.fi/case-comparing-collateral-alternatives/",
    "snippet": "This case study compares 3 different collateral types when selling ETH call options: Fiat, ETH (native token), and stETH (liquid staking token).",
    "source": "Lido Finance",
    "timestamp": 1728568931,
    "utc_time": "2024-10-10 14:02:11 UTC"
  },
  {
    "title": "Lido Institutional: Q3 2024 Review",
    "link": "https://blog.lido.fi/lido-institutional-q3-2024-review/",
    "snippet": "Q3 2024 has seen institutions announcing the independent integration of stETH, thus enabling their users’ access to Lido’s liquid staking middleware.",
    "source": "Lido Finance",
    "timestamp": 1728378757,
    "utc_time": "2024-10-08 09:12:37 UTC"
  },
  {
    "title": "Simple DVT: Obol Testnet #4 Results",
    "link": "https://blog.lido.fi/simple-dvt-obol-testnet-4-results/",
    "snippet": "<p>The most recent Lido x Obol <a href=\"https://operatorportal.lido.fi/modules/simple-dvt-module?ref=blog.lido.fi\"><u>Simple DVT</u></a> testnet has officially ended, with the aggregate validator set surpassing all of the minimum requirements to move forward to mainnet!</p><p>&#xa0;</p>\n<p>This was the 4th testnet where Node Operators operated validators utilizing the Lido protocol with Obol&#x2019;s DVT solution, following</p>",
    "source": "Lido Finance",
    "timestamp": 1728310249,
    "utc_time": "2024-10-07 14:10:49 UTC"
  },
  {
    "title": "CSM Early Adoption: Unique Opportunity for Ethereum Solo Stakers",
    "link": "https://blog.lido.fi/csm-early-adoption/",
    "snippet": "The Early Adoption period offers solo stakers priority access to CSM mainnet and a number of unique benefits. Get started with CSM EA here.",
    "source": "Lido Finance",
    "timestamp": 1728054613,
    "utc_time": "2024-10-04 15:10:13 UTC"
  },
  {
    "title": "Inside $25bn DeFi giant Lido’s plan to win over the finance world",
    "link": "https://www.dlnews.com/articles/defi/lido-fades-restaking-and-focuses-on-institutional-users/",
    "snippet": "Lido already accounts for 70% of the Ether liquid staking market. But it wants more.",
    "source": "DL News Feeds",
    "timestamp": 1727864977,
    "utc_time": "2024-10-02 10:29:37 UTC"
  },
  {
    "title": "Inside $25bn DeFi giant Lido’s plan to win over the finance world",
    "link": "https://www.dlnews.com/articles/defi/lido-fades-restaking-and-focuses-on-institutional-users/",
    "snippet": "Lido already accounts for 70% of the Ether liquid staking market. But it \nwants more.",
    "source": "DL News",
    "timestamp": 1727699343,
    "utc_time": "2024-09-30 12:29:03 UTC"
  },
  {
    "title": "Bringing Liquid Staking to the Fireblocks Network",
    "link": "https://blog.lido.fi/bringing-liquid-staking-to-the-fireblocks-network/",
    "snippet": "Lido Institutional is thrilled to share that Fireblocks has integrated Lido, enabling their users to stake their ETH with Lido’s liquid staking middleware for Ethereum.",
    "source": "Lido Finance",
    "timestamp": 1727098232,
    "utc_time": "2024-09-23 13:30:32 UTC"
  },
  {
    "title": "Lido on Mode Network",
    "link": "https://blog.lido.fi/lido-on-mode-network/",
    "snippet": "Lido's wstETH is now available on Mode - a DeFi focused L2 built for the Optimism Superchain.",
    "source": "Lido Finance",
    "timestamp": 1726147618,
    "utc_time": "2024-09-12 13:26:58 UTC"
  },
  {
    "title": "Introducing Drop: Liquid Staking Protocol for the Interchain",
    "link": "https://blog.lido.fi/introducing-drop-liquid-staking-protocol-for-the-interchain/",
    "snippet": "Introducing Drop - a liquid staking protocol designed for Interchain assets, backed by the Lido Alliance.",
    "source": "Lido Finance",
    "timestamp": 1726068068,
    "utc_time": "2024-09-11 15:21:08 UTC"
  },
  {
    "title": "Wintermute Enables Collateral Support of stETH",
    "link": "https://blog.lido.fi/wintermute-enables-collateral-support-of-steth/",
    "snippet": "Lido Institutional contributors are excited to share that stETH joins Wintermute’s multi-currency collateral support for OTC trading.",
    "source": "Lido Finance",
    "timestamp": 1726044776,
    "utc_time": "2024-09-11 08:52:56 UTC"
  },
  {
    "title": "Delegation: Enhancing Governance",
    "link": "https://blog.lido.fi/delegation-enhancing-governance/",
    "snippet": "Following a Snapshot vote and an on-chain vote, Lido DAO will be introducing governance delegation and incentive programs to enhance governance participation and to streamline decision-making across the DAO.",
    "source": "Lido Finance",
    "timestamp": 1724694324,
    "utc_time": "2024-08-26 17:45:24 UTC"
  },
  {
    "title": "Lido On BNB Chain",
    "link": "https://blog.lido.fi/lido-goes-to-bnbchain/",
    "snippet": "Lido's staked ETH is now on BNB Chain! Bridge your wstETH to the BNB Chain ecosystem to access hundreds of new DeFi opportunities.",
    "source": "Lido Finance",
    "timestamp": 1723729772,
    "utc_time": "2024-08-15 13:49:32 UTC"
  },
  {
    "title": "The Decentralized Validator Vault ft. Mellow, Obol & SSV.",
    "link": "https://blog.lido.fi/decentralized-validator-vault-mellow-obol-ssv/",
    "snippet": "Introducing the Decentralised Validator Vault with Mellow, built to enhance the adoption of Distributed Validators via Lido Simple DVT Module.",
    "source": "Lido Finance",
    "timestamp": 1723561498,
    "utc_time": "2024-08-13 15:04:58 UTC"
  },
  {
    "title": "Lido Community Staking Testnet: Overview",
    "link": "https://blog.lido.fi/community-staking-testnet-overview/",
    "snippet": "One month has passed since Lido's Community Staking Module (CSM) launched its testnet on Holesky. Here's an update!",
    "source": "Lido Finance",
    "timestamp": 1722522709,
    "utc_time": "2024-08-01 14:31:49 UTC"
  },
  {
    "title": "Deribit Launches Trading in Lido’s stETH",
    "link": "https://blog.lido.fi/deribit-launches-trading-in-lidos-steth/",
    "snippet": "Deribit announces a partnership with Lido Institutional which will see Deribit enabling the launch of trading in Lido’s stETH on their exchange.",
    "source": "Lido Finance",
    "timestamp": 1721140560,
    "utc_time": "2024-07-16 14:36:00 UTC"
  },
  {
    "title": "Lido Monthly Report: June 2024",
    "link": "https://blog.lido.fi/lido-monthly-report-june-2024/",
    "snippet": "<p>Welcome to the June edition of the Lido Monthly Report, a comprehensive source for insights into all of the latest developments.</p><!--kg-card-begin: markdown--><p>&#xa0;</p>\n<!--kg-card-end: markdown--><p>This report reviews another month of noteworthy metrics, new collaborations, and ongoing developments that highlight the overall performance and progress of Lido.</p><!--kg-card-begin: markdown--><p>&#xa0;</p>\n<!--kg-card-end: markdown--><p>For previous editions of the</p>",
    "source": "Lido Finance",
    "timestamp": 1719836940,
    "utc_time": "2024-07-01 12:29:00 UTC"
  },
  {
    "title": "Presenting the Community Staking Module Testnet",
    "link": "https://blog.lido.fi/presenting-community-staking-testnet/",
    "snippet": "The Lido Community Staking Module (CSM) testnet is live! Learn all you need to get started here.",
    "source": "Lido Finance",
    "timestamp": 1719834962,
    "utc_time": "2024-07-01 11:56:02 UTC"
  },
  {
    "title": "Lido Introduces 'Restaking Vaults' in Collaboration with Symbiotic, Mellow Finance",
    "link": "https://www.coindesk.com/tech/2024/06/11/lido-introduces-restaking-vaults-in-collaboration-with-symbiotic-mellow-finance/",
    "snippet": "The launch comes after restaking platform EigenLayer started to threaten \nLido's dominance in Ethereum DeFi.",
    "source": "CoinDesk",
    "timestamp": 1718064000,
    "utc_time": "2024-06-11 00:00:00 UTC"
  },
  {
    "title": "Lido investors withdraw $2.5bn in Ether from staking giant as rivals circle",
    "link": "https://www.dlnews.com/articles/defi/why-investors-withdrew-2bn-in-ether-from-staking-giant-lido/",
    "snippet": "Ethereum's largest DeFi protocol is stumbling amid the rise of 'liquid \nrestaking.'",
    "source": "DL News",
    "timestamp": 1713830400,
    "utc_time": "2024-04-23 00:00:00 UTC"
  },
  {
    "title": "Lido’s stETH leapfrogs XRP market value amid Ether staking frenzy",
    "link": "https://www.dlnews.com/articles/defi/lido-steth-market-cap-exceeds-ripple-xrp-amid-staking-frenzy/",
    "snippet": "Lido's flagship liquid staking token has overtaken XRP to become the \nsixth-largest crypto by market capitalisation with a value of $30 billion.",
    "source": "DL News",
    "timestamp": 1708905600,
    "utc_time": "2024-02-26 00:00:00 UTC"
  },
  {
    "title": "This Ether staking protocol doubles rewards of dominant Lido to win $1.5bn slice of market",
    "link": "https://www.dlnews.com/articles/defi/eth-liquid-staking-newcomer-mantle-doubles-lido-rewards/",
    "snippet": "Liquid staking protocols are pulling out all the stops to attract deposits. \nMantle's liquid staking protocol currently offers an annual Ether staking \nyield...",
    "source": "DL News",
    "timestamp": 1708387200,
    "utc_time": "2024-02-20 00:00:00 UTC"
  },
  {
    "title": "Does stETH have a liquidity issue? Lido says no but not everyone’s convinced",
    "link": "https://www.dlnews.com/articles/defi/low-lido-steth-staked-ethereum-liquidity-could-cause-depeg/",
    "snippet": "A congested Ethereum validator exit queue could become a major problem for \nLido and its stETH token.",
    "source": "DL News",
    "timestamp": 1705881600,
    "utc_time": "2024-01-22 00:00:00 UTC"
  },
  {
    "title": "Lido Review in 2024: Pros, Cons, and Features",
    "link": "https://www.ccn.com/lido-review/",
    "snippet": "Lido Finance excels in delivering top-tier staking services. It features a \nuser-friendly interface, competitive fee structures, and an enticing \nreferral...",
    "source": "CCN.com",
    "timestamp": 1705622400,
    "utc_time": "2024-01-19 00:00:00 UTC"
  },
  {
    "title": "Hashnote e Lido danno il via ad una soluzione di crypto staking liquido su Ethereum per gli utenti istituzionali",
    "link": "https://en.cryptonomist.ch/2023/12/22/hashnote-and-lido-are-launching-a-liquid-crypto-staking-solution-on-ethereum-for-institutional-users/",
    "snippet": "Hashnote, a Miami-based technology company focused on institutional \ninvestments, has just launched the stETH Fund: a regulated fund that allows \nfor...",
    "source": "The Cryptonomist",
    "timestamp": 1703203200,
    "utc_time": "2023-12-22 00:00:00 UTC"
  },
  {
    "title": "stETH Philippines Guide | Lido Staked Ether Usecases",
    "link": "https://bitpinas.com/learn-how-to-guides/steth-ph-lido-staked-ether/",
    "snippet": "stETH is a liquid token. This means that it can be used for DeFi \napplications, like crypto lending. It is also an ERC-20 token and follows \nthe ETH 2.0 Beacon...",
    "source": "BitPinas",
    "timestamp": 1697500800,
    "utc_time": "2023-10-17 00:00:00 UTC"
  },
  {
    "title": "Is stETH Liquid Enough?",
    "link": "https://research.kaiko.com/insights/steth-liquidity",
    "snippet": "stETH is displacing ETH on DeFi protocols. But is it liquid enough?",
    "source": "Kaiko - Research",
    "timestamp": 1688601600,
    "utc_time": "2023-07-06 00:00:00 UTC"
  },
  {
    "title": "The Ultimate Guide to Lido Staked ETH (stETH)",
    "link": "https://beincrypto.com/learn/lido-staked-eth/",
    "snippet": "What is Lido-staked ETH? This guide unpacks everything you need to know \nabout Lido Finance and its popular stETH token.",
    "source": "BeInCrypto",
    "timestamp": 1682899200,
    "utc_time": "2023-05-01 00:00:00 UTC"
  },
  {
    "title": "Lido Activates \"Staking Rate Limit\" as ETH Deposits Spike",
    "link": "https://dailycoin.com/lido-activates-staking-rate-limit-as-eth-deposits-spike/",
    "snippet": "Lido Finance and its Staked ETH (stETH), running the most popular staking \npool, have activated a “staking rate limit” after over 150,000 ETH were \nstaked on...",
    "source": "DailyCoin",
    "timestamp": 1677456000,
    "utc_time": "2023-02-27 00:00:00 UTC"
  },
  {
    "title": "Lido Staked ETH (stETH): All You Need To Know",
    "link": "https://learn.bybit.com/altcoins/what-is-steth-lido-staked-eth/",
    "snippet": "stETH is a liquid staking derivatives token representing staked Ether on \nLido (LDO) that allows the token holder to participate in DeFi while \naccruing...",
    "source": "Bybit Learn",
    "timestamp": 1676592000,
    "utc_time": "2023-02-17 00:00:00 UTC"
  },
  {
    "title": "Lido Testnet Launch",
    "link": "https://lidofinance.medium.com/lido-testnet-launch-d33a95b0dd5e?source=rss-139df851eff9------2",
    "snippet": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GX0SY8NbTjCUuSPzG3zCHw.png\" /></figure><p>Lido is a liquid Ethereum staking solution letting you earn staking rewards with no lock-ups or minimum deposits whilst contributing to the security of the Ethereum 2.0 chain.</p><p>We’re thrilled to announce the launch of the Lido protocol testnet, which allows users to stake and convert testnet ETH to staked ETH(stETH). With this also comes the test launch of the Lido DAO governance tools for the Ethereum staking service.</p><h3>Testnet Objectives</h3><p>The testnet launch sees the deployment of contracts — on Goerli testnet — to test Lido in dynamic conditions and gain operational experience for participants. An added bonus is that the testnet will demonstrate the simplicity of staking Ethereum with Lido.</p><p>Objectives with respect to Lido over the coming weeks are to:</p><ul><li>Perform distributed key generation ceremony for withdrawal credentials, which will hold all Lido’s staked ether;</li><li>Deploy the Lido DAO, distribute governance tokens, and set up all necessary parameters via DAO members voting procedures;</li><li>Assign and launch oracles, which are responsible for reporting cumulative Lido balances on the Ethereum 2.0 beacon chain to the smart contract;</li><li>Assign node operators to whom staking on the Ethereum 2.0 beacon chain will be delegated; and</li><li>Start accepting ether deposits in Goerli and check Lido’s operations.</li></ul><p>In addition to showcasing what has been developed, this testnet launch is an opportunity for Ethereum validators to demonstrate their expertise. Lido stakes through a set of proven validators and, in order to guarantee performance, the validators are best-in-industry.</p><h3>Testnet Roadmap</h3><p>The roadmap for the coming week is as follows:</p><h3>Wednesday | Nov 25</h3><ul><li>The first Lido signature generation ceremony is conducted.</li><li>The final testnet version of the protocol is deployed.</li><li>The <a href=\"https://docs.google.com/document/d/1S0cLkS8r3YihZ3vTBsHYFqyIkOT-y-SKhxRIFAsb87E/edit?usp=sharing\">DAO Token Holder Manual</a> is published.</li><li>DAO holders vote for initial protocol parameters and for the inclusion of Node Operators and Oracles.</li></ul><p>At this point, the protocol is ready to accept user funds. There will be a quick run for working validators to earn revenue as early as possible, given the clog in Pyrmont validator entry queue.</p><ul><li>A Node Operator with 10 signing keys will be added and accepted by the DAO with the testnets orchestrators (combined, testnet orchestrators votes will reach the quorum to ensure the test run will run to completion).</li><li>The testnet orchestrators will perform DAO voting for setting the withdrawal credentials chosen during the ceremony.</li><li>Testnet orchestrators will submit 320 ETH and use the protocol to deposit them using the keys submitted in the first step.</li><li>One node operator is needed to assist with running that first validator node — please let us know if you’re willing to help.</li></ul><h3>Thursday | Nov 26</h3><ul><li>The second, text-based, signature generation ceremony is started. This ceremony will last until Tuesday, Dec 1. It won’t be used in the testnet, just generated.</li><li>Node Operator and Oracle manuals are published.</li><li>Oracle Committee Members deploy oracle daemons (at least 5 Oracle Committee Members).</li><li>Node Operators generate and submit signing keys (100 keys each, at least 6 operators).</li><li>Node Operators deploy validator clients for the submitted keys.</li></ul><h3>Friday | Nov 27</h3><ul><li>DAO token holders vote for accepting the signing keys submitted by Node Operators.</li><li>DAO token holders initiate depositing the received and buffered user funds to the Beacon chain.</li></ul><h3>Saturday | Nov 28</h3><ul><li>Monitoring the system working as intended and performing more deposits.</li></ul><h3>Monday | Nov 30</h3><ul><li>Testing integration with Uniswap v1.</li></ul><p>If you have question, please send message @lidofi on telegram</p><img alt=\"\" height=\"1\" src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=d33a95b0dd5e\" width=\"1\" />",
    "source": "Stories by Lido Finance on Medium",
    "timestamp": 1606524075,
    "utc_time": "2020-11-28 00:41:15 UTC"
  },
  {
    "title": "Introducing Lido",
    "link": "https://lidofinance.medium.com/introducing-lido-8aee079cae8e?source=rss-139df851eff9------2",
    "snippet": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/1*dYaMl99kR7dJ3UiBfUOfGQ.png\" /></figure><p>In the next few weeks, Ethereum is expected to launch ETH 2.0 and begin the transition to proof of stake (PoS) as discussed in the original Ethereum whitepaper.</p><p>PoS networks are not new. Although Tezos and Cosmos are amongst the 100s of networks that are secured by PoS today, when Ethereum’s transition is complete, it will be the largest PoS network by a significant margin.</p><p>Ethereum’s PoS launch raises some additional interesting issues:</p><ol><li>Early stakers will lock their ETH until transactions are enabled on ETH 2.0, which could be a few months or several years.</li><li>ETH cannot be moved/traded or used as collateral when a user is staking ETH — in other words, staked ETH is illiquid.</li><li>Users can only stake multiples of 32 ETH.</li></ol><p><strong>Early staking commitment</strong></p><p>When ETH 2.0 launches it will be a multi-phase rollout. Staking will launch quite early (in fact, the deposit contract is already live), but the state transitions — including transfers — will not be launched until Phase 2 of the ETH 2.0 transition. Without transactions enabled, it will be impossible to move, trade or spend ETH that has been staked.</p><p>Practically, this means that any ETH staked on ETH 2.0 early in the rollout will be locked and unmoveable for a period of time — possibly even up to 2 or 3 years.</p><p>This may deter participation in staking on ETH 2.0 given that users sacrifice the ability to use, sell, trade or do anything else with their ETH for that period of time.</p><p><strong>Illiquidity</strong></p><p>During the period mentioned above, staked ETH will be non-transferable and illiquid.</p><p>Even after transactions are enabled on ETH 2.0 and it becomes possible to unstake ETH, ETH that is staked will remain illiquid for the period of time it is staked.</p><p>This presents an interesting dilemma — adversarial incentives between securing the network through staking and participating in DeFi are introduced. Users will have to choose between the rewards offered from staking or the yield offered from DeFi protocols.</p><p>This has been best described by Tarun from Gauntlet in his research on <a href=\"https://assets.pubpub.org/uegr5e8g/61581338612941.pdf\">competitive equilibria between staking and on-chain lending</a> and Haseeb from Dragonfly in <a href=\"https://medium.com/dragonfly-research/how-defi-cannibalizes-pos-security-84b146f00697\">his commentary on the paper</a>.</p><p><strong>Staking 32 ETH multiples</strong></p><p>Finally, some users may face an additional issue with the requirement to stake multiples of 32 ETH.</p><p>At the time of this post, a user would need to stake no less than $11,744.32 in order to participate in securing the Ethereum network under ETH 2.0.</p><p>People that own 5 ETH and want to participate in staking will not be able to do so alone. Equally, people who own 45 ETH will only be able to stake 32 ETH from their holding.</p><h3>So… why Lido?</h3><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*ssjiQwdiwKFDebs4\" /></figure><p>Lido is a staking solution for ETH 2.0 built to solve these problems and backed by several industry-leading staking providers. It makes staked ETH liquid and allows participation with any amount of ETH.</p><p>When using Lido to stake your ETH on the Ethereum beacon chain, users will receive a token (bETH), which represents their ETH on the Ethereum beacon chain on a 1:1 basis. It effectively acts as a bridge bringing ETH 2.0’s staking rewards to ETH 1.0.</p><p>As a user’s staked ETH generates staking rewards from ETH 2.0, the user’s ETH balance on the beacon chain will increase. bETH balances will update correspondingly once per day allowing you to access on ETH 1.0 the value of your staking rewards received on ETH 2.0.</p><p>Users can use bETH in all of the same ways that they can use ETH: sell it, spend it and, since it is compatible to be used in DeFi, use it as collateral for on-chain lending. When transactions are enabled on ETH 2.0, users can also redeem bETH for ETH.</p><p>We believe that bETH will be an important base primitive in DeFi, and a foundational building block for the Ethereum money-lego stack.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*Wf6HuUNyweqijxC0\" /></figure><p>Lido is intended to remove the adversarial incentives of ETH 2.0 by allowing users to stake their ETH while simultaneously participating in on-chain lending with bETH, thus providing them access to additional yield from other protocols and producing a more secure ETH network.</p><h3>What happens next?</h3><p>It sounds simple, but there is additional nuance. Over the next few weeks p2p.org CTO will share further blog posts about Lido’s architecture and provide clarity for launch timelines; the code will become open sourced; and the testnet product will become accessible.</p><p>Meanwhile, if you’d like to help build Lido, you can telegram <a href=\"https://t.me/lidofi\">@lidofi</a> and we’ll be in touch.</p><p>Presale &amp; Airdrop form : <a href=\"https://forms.gle/usf622C3BXZpxyGd9\">https://forms.gle/usf622C3BXZpxyGd9</a><br />Announcement Channel : <a href=\"https://t.me/LidoFinanceOfficial\">https://t.me/LidoFinanceOfficial</a></p><p>Until next time.</p><p>Lido Finance Team</p><img alt=\"\" height=\"1\" src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=8aee079cae8e\" width=\"1\" />",
    "source": "Stories by Lido Finance on Medium",
    "timestamp": 1602776290,
    "utc_time": "2020-10-15 15:38:10 UTC"
  }
]
